Revit 2027 API
SpecTypeId.HvacPressure Property
 Pressure, in discipline HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HvacPressure { get; }
Public Shared ReadOnly Property HvacPressure As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HvacPressure {
	ForgeTypeId^ get ();
}
static member HvacPressure : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace